#!/usr/bin/env python3
# -*- coding: utf-8 -*-

if __name__ == '__main__':
    school = {
    "1а": 30,
    "1б": 27,
    "2а": 28,
    "2б": 28,
    "2в": 24,
    "3а": 35,
    "3б": 32,
    "3в": 30,
    "3г": 30,
    "4а": 29,
    "4б": 26,
    "5а": 45,
    "6а": 44,
    "7а": 42,
    "8а": 40,
    "9а": 36,
    "10а": 15,
    "10б": 15,
    "11а": 12,
    "11б": 10
}
    for key, value in school.items():
        print("Класс: ", key, " - количество учащихся: ", value)
    a = input('Введите название именяемого класса: ')
    a1 = int(input('Количество учеников изменяемого класса: '))
    b = input("Введите новый класс: ")
    b1 = int(input("Введите сколько новых учеников в классе: "))
    c = input('Введите класс, который был расформирован: ')
    del school[c]
    school.update({b: b1})
    summ = 0
    for key, value in list(school.items()):
        if a == key:
            value = a1
        s = int(value)
        summ = s + summ
        print("Класс: ", key, " - количество учащихся: ", value)
    print('Общее количество учащихся в школе: ', summ)
